%% BP神经网络
clc
clear
%% 数据预测(跳高成绩预测)
data_x=[3.2 3.2 3 3.2 3.2 3.4 3.2 3 3.2 3.2 3.2 3.9 3.1 3.2;
9.6 10.3 9 10.3 10.1 10 9.6 9 9.6 9.2 9.5 9 9.5 9.7;
3.45 3.75 3.5 3.65 3.5 3.4 3.55 3.5 3.55 3.5 3.4 3.1 3.6 3.45;
2.15 2.2 2.2 2.2 2 2.15 2.14 2.1 2.1 2.1 2.15 2 2.1 2.15;
140 120 140 150 80 130 130 100 130 140 115 80 90 130;
2.8 3.4 3.5 2.8 1.5 3.2 3.5 1.8 3.5 2.5 2.8 2.2 2.7 4.6;
11 10.9 11.4 10.8 11.3 11.5 11.8 11.3 11.8 11 11.9 13 11.1 10.85;
50 70 50 80 50 60 65 40 65 50 50 50 70 70];
data_y=[2.24 2.33 2.24 2.32 2.2 2.27 2.2 2.26 2.2 2.24 2.24 2.2 2.2 2.35];
test_x=[3.0,9.3,3.3,2.05,100,2.8,11.2,50]';
[x,min_x,max_x,y,min_y,max_y]=premnmx(data_x,data_y);
para=[8,6,1];
iter=50000;
error=0.00001;
alpha=0.02;
[w,b]=BPnetwork(x,y,para,iter,error,alpha);
%% 预测&分类计算函数
test_y=cell(1,length(w));
test_y{1,1}=test_x;
for i=2:length(w)
    if(i==length(w))
        test_y{1,i}=BPfunction(w{1,i}*test_y{1,i-1}+b{1,i});
    else
        test_y{1,i}=w{1,i}*test_y{1,i-1}+b{1,i};
    end
end
pridict_y=(max_y-min_y)*test_y{1,length(w)}+min_y;
disp('输入数据为:');
disp(test_x')
disp(['预测数据为:',num2str(pridict_y)])



























